In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={
    "name":['harry','anushka','kuki','sonu'],
    "marks":[98,90,99,56],
    "city":['new delhi','dwarka mor','jharkhand','bareilly']
}

In [3]:
df=pd.DataFrame(dict1)

In [4]:
df

      name  marks        city
0    harry     98   new delhi
1  anushka     90  dwarka mor
2     kuki     99   jharkhand
3     sonu     56    bareilly

In [5]:
df.to_csv('friends.csv')

In [6]:
df.to_csv('friends_index_false.csv',index=False)

In [7]:
df.head(2)

      name  marks        city
0    harry     98   new delhi
1  anushka     90  dwarka mor

In [8]:
df.tail(2)

   name  marks       city
2  kuki     99  jharkhand
3  sonu     56   bareilly

In [9]:
df.describe()

           marks
count   4.000000
mean   85.750000
std    20.238165
min    56.000000
25%    81.500000
50%    94.000000
75%    98.250000
max    99.000000

In [10]:
anushka=pd.read_csv('anushka.csv')

In [11]:
anushka

   Unnamed: 0.1  Unnamed: 0     name  marks        city
0             0           0    harry     50   new delhi
1             1           1  anushka     90  dwarka mor
2             2           2     kuki     99   jharkhand
3             3           3     sonu     56    bareilly

In [12]:
anushka['marks'][0]

np.int64(50)

In [13]:
anushka['marks'][0]=50

C:\Users\MUNNI\AppData\Local\Temp\ipykernel_17964\2282411646.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  anushka['marks'][0]=50

In [14]:
anushka

   Unnamed: 0.1  Unnamed: 0     name  marks        city
0             0           0    harry     50   new delhi
1             1           1  anushka     90  dwarka mor
2             2           2     kuki     99   jharkhand
3             3           3     sonu     56    bareilly

In [15]:
anushka.to_csv('anushka.csv')

In [16]:
anushka.index=['first','second','third','fourth']
anushka

        Unnamed: 0.1  Unnamed: 0     name  marks        city
first              0           0    harry     50   new delhi
second             1           1  anushka     90  dwarka mor
third              2           2     kuki     99   jharkhand
fourth             3           3     sonu     56    bareilly

In [19]:
ser = pd.Series(np.random.rand(34))

In [21]:
ser

0     0.833826
1     0.054714
2     0.318468
3     0.944813
4     0.574221
5     0.783792
6     0.354525
7     0.038053
8     0.026838
9     0.752280
10    0.674406
11    0.553835
12    0.038215
13    0.678299
14    0.552367
15    0.816796
16    0.864044
17    0.886918
18    0.054250
19    0.115639
20    0.053128
21    0.012898
22    0.777575
23    0.667559
24    0.425843
25    0.985380
26    0.684455
27    0.446786
28    0.060095
29    0.996928
30    0.221225
31    0.216230
32    0.173751
33    0.195064
dtype: float64

In [22]:
type(ser)

pandas.core.series.Series

In [26]:
newdf = pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [27]:
newdf.head()

          0         1         2         3         4
0  0.000823  0.536579  0.792987  0.026371  0.355710
1  0.784543  0.224446  0.272634  0.231071  0.668993
2  0.295894  0.023143  0.917779  0.951466  0.646234
3  0.214768  0.689296  0.218977  0.988390  0.662938
4  0.773817  0.731441  0.914211  0.154555  0.080102

In [28]:
newdf

            0         1         2         3         4
0    0.000823  0.536579  0.792987  0.026371  0.355710
1    0.784543  0.224446  0.272634  0.231071  0.668993
2    0.295894  0.023143  0.917779  0.951466  0.646234
3    0.214768  0.689296  0.218977  0.988390  0.662938
4    0.773817  0.731441  0.914211  0.154555  0.080102
..        ...       ...       ...       ...       ...
329  0.575122  0.526338  0.261168  0.753307  0.768892
330  0.044631  0.306817  0.107822  0.053552  0.014893
331  0.382224  0.590939  0.308403  0.298711  0.529532
332  0.368645  0.988167  0.393486  0.835483  0.697487
333  0.900716  0.018883  0.250007  0.752196  0.293452

[334 rows x 5 columns]

In [32]:
type(newdf)
newdf.head()

          0         1         2         3         4
0  0.000823  0.536579  0.792987  0.026371  0.355710
1  0.784543  0.224446  0.272634  0.231071  0.668993
2  0.295894  0.023143  0.917779  0.951466  0.646234
3  0.214768  0.689296  0.218977  0.988390  0.662938
4  0.773817  0.731441  0.914211  0.154555  0.080102

In [30]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.492255    0.477205    0.479300    0.481933    0.511812
std      0.284087    0.289613    0.287804    0.292252    0.276296
min      0.000759    0.001395    0.002167    0.002384    0.006772
25%      0.261605    0.224220    0.241484    0.243682    0.283961
50%      0.483635    0.483393    0.482405    0.459809    0.517580
75%      0.740053    0.690962    0.715183    0.724584    0.744820
max      0.999003    0.998657    0.997671    0.992779    0.995896

In [31]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [34]:
newdf[0][0] = "anushka"

In [35]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [36]:
newdf.head()

          0         1         2         3         4
0   anushka  0.536579  0.792987  0.026371  0.355710
1  0.784543  0.224446  0.272634  0.231071  0.668993
2  0.295894  0.023143  0.917779  0.951466  0.646234
3  0.214768  0.689296  0.218977  0.988390  0.662938
4  0.773817  0.731441  0.914211  0.154555  0.080102

In [37]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [38]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [39]:
newdf.to_numpy()

array([['anushka', 0.536579300263982, 0.7929874353729226,
        0.026371359887509604, 0.35571010960819427],
       [0.7845434345467552, 0.2244457000158958, 0.27263382990488116,
        0.23107080175658123, 0.6689930449281961],
       [0.2958944094351599, 0.02314267783693147, 0.9177788764053791,
        0.9514655893817546, 0.6462338417085934],
       ...,
       [0.3822239184059749, 0.5909390563134432, 0.30840284593637535,
        0.2987111363594095, 0.5295323378799902],
       [0.36864493773319096, 0.9881670322629198, 0.39348573764673034,
        0.8354831844440902, 0.6974869913169224],
       [0.9007160515875814, 0.018882531829480853, 0.2500069957212733,
        0.752195823212904, 0.29345179698791735]],
      shape=(334, 5), dtype=object)

In [40]:
newdf[0][0]=0.3

In [41]:
newdf.head()

          0         1         2         3         4
0       0.3  0.536579  0.792987  0.026371  0.355710
1  0.784543  0.224446  0.272634  0.231071  0.668993
2  0.295894  0.023143  0.917779  0.951466  0.646234
3  0.214768  0.689296  0.218977  0.988390  0.662938
4  0.773817  0.731441  0.914211  0.154555  0.080102

In [42]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.3,0.784543,0.295894,0.214768,0.773817,0.029035,0.952713,0.582168,0.281187,0.564606,...,0.379596,0.871417,0.209812,0.487988,0.650837,0.575122,0.044631,0.382224,0.368645,0.900716
1,0.536579,0.224446,0.023143,0.689296,0.731441,0.775559,0.066109,0.65134,0.547462,0.618389,...,0.297617,0.929268,0.533047,0.753275,0.138664,0.526338,0.306817,0.590939,0.988167,0.018883
2,0.792987,0.272634,0.917779,0.218977,0.914211,0.639121,0.889306,0.067283,0.940248,0.450666,...,0.270808,0.099305,0.240629,0.475138,0.128455,0.261168,0.107822,0.308403,0.393486,0.250007
3,0.026371,0.231071,0.951466,0.98839,0.154555,0.497716,0.859923,0.131897,0.363012,0.679846,...,0.514006,0.05978,0.52493,0.814056,0.992779,0.753307,0.053552,0.298711,0.835483,0.752196
4,0.35571,0.668993,0.646234,0.662938,0.080102,0.934235,0.141694,0.259444,0.709621,0.332629,...,0.833435,0.490495,0.206834,0.35558,0.444512,0.768892,0.014893,0.529532,0.697487,0.293452

In [43]:
newdf.head()

          0         1         2         3         4
0       0.3  0.536579  0.792987  0.026371  0.355710
1  0.784543  0.224446  0.272634  0.231071  0.668993
2  0.295894  0.023143  0.917779  0.951466  0.646234
3  0.214768  0.689296  0.218977  0.988390  0.662938
4  0.773817  0.731441  0.914211  0.154555  0.080102

In [44]:
newdf.sort_index(axis=0,ascending=False)

            0         1         2         3         4
333  0.900716  0.018883  0.250007  0.752196  0.293452
332  0.368645  0.988167  0.393486  0.835483  0.697487
331  0.382224  0.590939  0.308403  0.298711  0.529532
330  0.044631  0.306817  0.107822  0.053552  0.014893
329  0.575122  0.526338  0.261168  0.753307  0.768892
..        ...       ...       ...       ...       ...
4    0.773817  0.731441  0.914211  0.154555  0.080102
3    0.214768  0.689296  0.218977  0.988390  0.662938
2    0.295894  0.023143  0.917779  0.951466  0.646234
1    0.784543  0.224446  0.272634  0.231071  0.668993
0         0.3  0.536579  0.792987  0.026371  0.355710

[334 rows x 5 columns]

In [45]:
newdf.sort_index(axis=1,ascending=False)

            4         3         2         1         0
0    0.355710  0.026371  0.792987  0.536579       0.3
1    0.668993  0.231071  0.272634  0.224446  0.784543
2    0.646234  0.951466  0.917779  0.023143  0.295894
3    0.662938  0.988390  0.218977  0.689296  0.214768
4    0.080102  0.154555  0.914211  0.731441  0.773817
..        ...       ...       ...       ...       ...
329  0.768892  0.753307  0.261168  0.526338  0.575122
330  0.014893  0.053552  0.107822  0.306817  0.044631
331  0.529532  0.298711  0.308403  0.590939  0.382224
332  0.697487  0.835483  0.393486  0.988167  0.368645
333  0.293452  0.752196  0.250007  0.018883  0.900716

[334 rows x 5 columns]

In [46]:
newdf.head()

          0         1         2         3         4
0       0.3  0.536579  0.792987  0.026371  0.355710
1  0.784543  0.224446  0.272634  0.231071  0.668993
2  0.295894  0.023143  0.917779  0.951466  0.646234
3  0.214768  0.689296  0.218977  0.988390  0.662938
4  0.773817  0.731441  0.914211  0.154555  0.080102

In [47]:
newdf[0]

0           0.3
1      0.784543
2      0.295894
3      0.214768
4      0.773817
         ...
329    0.575122
330    0.044631
331    0.382224
332    0.368645
333    0.900716
Name: 0, Length: 334, dtype: object

In [48]:
type(newdf[0])

pandas.core.series.Series

In [49]:
newdf2 = newdf

In [50]:
newdf2[0][0]=9783

In [51]:
newdf

            0         1         2         3         4
0        9783  0.536579  0.792987  0.026371  0.355710
1    0.784543  0.224446  0.272634  0.231071  0.668993
2    0.295894  0.023143  0.917779  0.951466  0.646234
3    0.214768  0.689296  0.218977  0.988390  0.662938
4    0.773817  0.731441  0.914211  0.154555  0.080102
..        ...       ...       ...       ...       ...
329  0.575122  0.526338  0.261168  0.753307  0.768892
330  0.044631  0.306817  0.107822  0.053552  0.014893
331  0.382224  0.590939  0.308403  0.298711  0.529532
332  0.368645  0.988167  0.393486  0.835483  0.697487
333  0.900716  0.018883  0.250007  0.752196  0.293452

[334 rows x 5 columns]

In [52]:
newdf2=newdf.copy()

In [53]:
newdf2[0][0]=97835

C:\Users\MUNNI\AppData\Local\Temp\ipykernel_17964\3030230984.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0]=97835

In [54]:
newdf

            0         1         2         3         4
0        9783  0.536579  0.792987  0.026371  0.355710
1    0.784543  0.224446  0.272634  0.231071  0.668993
2    0.295894  0.023143  0.917779  0.951466  0.646234
3    0.214768  0.689296  0.218977  0.988390  0.662938
4    0.773817  0.731441  0.914211  0.154555  0.080102
..        ...       ...       ...       ...       ...
329  0.575122  0.526338  0.261168  0.753307  0.768892
330  0.044631  0.306817  0.107822  0.053552  0.014893
331  0.382224  0.590939  0.308403  0.298711  0.529532
332  0.368645  0.988167  0.393486  0.835483  0.697487
333  0.900716  0.018883  0.250007  0.752196  0.293452

[334 rows x 5 columns]

In [55]:
newdf.loc[0,0]=654

In [56]:
newdf.head(2)

          0         1         2         3         4
0       654  0.536579  0.792987  0.026371  0.355710
1  0.784543  0.224446  0.272634  0.231071  0.668993

In [57]:
newdf.columns = list("ABCDE")

In [60]:
newdf.head(2)

          A         B         C         D         E
0       654  0.536579  0.792987  0.026371  0.355710
1  0.784543  0.224446  0.272634  0.231071  0.668993

In [61]:
newdf.loc[0,0] = 654

In [62]:
newdf.head()

          A         B         C         D         E      0
0       654  0.536579  0.792987  0.026371  0.355710  654.0
1  0.784543  0.224446  0.272634  0.231071  0.668993    NaN
2  0.295894  0.023143  0.917779  0.951466  0.646234    NaN
3  0.214768  0.689296  0.218977  0.988390  0.662938    NaN
4  0.773817  0.731441  0.914211  0.154555  0.080102    NaN

In [63]:
newdf.loc[0,'A']=65445

In [64]:
newdf.head()

          A         B         C         D         E      0
0     65445  0.536579  0.792987  0.026371  0.355710  654.0
1  0.784543  0.224446  0.272634  0.231071  0.668993    NaN
2  0.295894  0.023143  0.917779  0.951466  0.646234    NaN
3  0.214768  0.689296  0.218977  0.988390  0.662938    NaN
4  0.773817  0.731441  0.914211  0.154555  0.080102    NaN

In [65]:
newdf.drop(0,axis=1)

            A         B         C         D         E
0       65445  0.536579  0.792987  0.026371  0.355710
1    0.784543  0.224446  0.272634  0.231071  0.668993
2    0.295894  0.023143  0.917779  0.951466  0.646234
3    0.214768  0.689296  0.218977  0.988390  0.662938
4    0.773817  0.731441  0.914211  0.154555  0.080102
..        ...       ...       ...       ...       ...
329  0.575122  0.526338  0.261168  0.753307  0.768892
330  0.044631  0.306817  0.107822  0.053552  0.014893
331  0.382224  0.590939  0.308403  0.298711  0.529532
332  0.368645  0.988167  0.393486  0.835483  0.697487
333  0.900716  0.018883  0.250007  0.752196  0.293452

[334 rows x 5 columns]

In [66]:
newdf.head()

          A         B         C         D         E      0
0     65445  0.536579  0.792987  0.026371  0.355710  654.0
1  0.784543  0.224446  0.272634  0.231071  0.668993    NaN
2  0.295894  0.023143  0.917779  0.951466  0.646234    NaN
3  0.214768  0.689296  0.218977  0.988390  0.662938    NaN
4  0.773817  0.731441  0.914211  0.154555  0.080102    NaN

In [68]:
newdf.loc[[1,2],['C','D']]

          C         D
1  0.272634  0.231071
2  0.917779  0.951466

In [70]:
newdf.loc[:,['C','D']]

            C         D
0    0.792987  0.026371
1    0.272634  0.231071
2    0.917779  0.951466
3    0.218977  0.988390
4    0.914211  0.154555
..        ...       ...
329  0.261168  0.753307
330  0.107822  0.053552
331  0.308403  0.298711
332  0.393486  0.835483
333  0.250007  0.752196

[334 rows x 2 columns]

In [71]:
newdf.loc[[1,2],:]

          A         B         C         D         E   0
1  0.784543  0.224446  0.272634  0.231071  0.668993 NaN
2  0.295894  0.023143  0.917779  0.951466  0.646234 NaN

In [74]:
newdf.loc[(newdf['A']<0.3) & (newdf['C']>0.1)]

            A         B         C         D         E   0
2    0.295894  0.023143  0.917779  0.951466  0.646234 NaN
3    0.214768  0.689296  0.218977  0.988390  0.662938 NaN
5    0.029035  0.775559  0.639121  0.497716  0.934235 NaN
8    0.281187  0.547462  0.940248  0.363012  0.709621 NaN
13   0.085799  0.736071  0.862166  0.422678  0.793939 NaN
..        ...       ...       ...       ...       ...  ..
320  0.236308  0.133297  0.755877  0.305210  0.048752 NaN
321  0.079522  0.856760  0.496867  0.321064  0.341386 NaN
323  0.218304  0.680564  0.516980  0.582579  0.626657 NaN
326  0.209812  0.533047  0.240629  0.524930  0.206834 NaN
330  0.044631  0.306817  0.107822  0.053552  0.014893 NaN

[93 rows x 6 columns]

In [75]:
newdf.iloc[0,4]

np.float64(0.35571010960819427)

In [77]:
newdf.iloc[[0,5],[1,2]]

          B         C
0  0.536579  0.792987
5  0.775559  0.639121

In [79]:
newdf.head(3)

          A         B         C         D         E      0
0     65445  0.536579  0.792987  0.026371  0.355710  654.0
1  0.784543  0.224446  0.272634  0.231071  0.668993    NaN
2  0.295894  0.023143  0.917779  0.951466  0.646234    NaN

In [80]:
newdf.drop([0])

            A         B         C         D         E   0
1    0.784543  0.224446  0.272634  0.231071  0.668993 NaN
2    0.295894  0.023143  0.917779  0.951466  0.646234 NaN
3    0.214768  0.689296  0.218977  0.988390  0.662938 NaN
4    0.773817  0.731441  0.914211  0.154555  0.080102 NaN
5    0.029035  0.775559  0.639121  0.497716  0.934235 NaN
..        ...       ...       ...       ...       ...  ..
329  0.575122  0.526338  0.261168  0.753307  0.768892 NaN
330  0.044631  0.306817  0.107822  0.053552  0.014893 NaN
331  0.382224  0.590939  0.308403  0.298711  0.529532 NaN
332  0.368645  0.988167  0.393486  0.835483  0.697487 NaN
333  0.900716  0.018883  0.250007  0.752196  0.293452 NaN

[333 rows x 6 columns]

In [82]:
newdf.drop(['A','C'],axis=1)

            B         D         E      0
0    0.536579  0.026371  0.355710  654.0
1    0.224446  0.231071  0.668993    NaN
2    0.023143  0.951466  0.646234    NaN
3    0.689296  0.988390  0.662938    NaN
4    0.731441  0.154555  0.080102    NaN
..        ...       ...       ...    ...
329  0.526338  0.753307  0.768892    NaN
330  0.306817  0.053552  0.014893    NaN
331  0.590939  0.298711  0.529532    NaN
332  0.988167  0.835483  0.697487    NaN
333  0.018883  0.752196  0.293452    NaN

[334 rows x 4 columns]

In [83]:
newdf.drop(['A','D'],axis=1,inplace=True)

In [84]:
newdf

            B         C         E      0
0    0.536579  0.792987  0.355710  654.0
1    0.224446  0.272634  0.668993    NaN
2    0.023143  0.917779  0.646234    NaN
3    0.689296  0.218977  0.662938    NaN
4    0.731441  0.914211  0.080102    NaN
..        ...       ...       ...    ...
329  0.526338  0.261168  0.768892    NaN
330  0.306817  0.107822  0.014893    NaN
331  0.590939  0.308403  0.529532    NaN
332  0.988167  0.393486  0.697487    NaN
333  0.018883  0.250007  0.293452    NaN

[334 rows x 4 columns]

In [85]:
newdf.drop([1,5],axis=0,inplace=True)

In [86]:
newdf

            B         C         E      0
0    0.536579  0.792987  0.355710  654.0
2    0.023143  0.917779  0.646234    NaN
3    0.689296  0.218977  0.662938    NaN
4    0.731441  0.914211  0.080102    NaN
6    0.066109  0.889306  0.141694    NaN
..        ...       ...       ...    ...
329  0.526338  0.261168  0.768892    NaN
330  0.306817  0.107822  0.014893    NaN
331  0.590939  0.308403  0.529532    NaN
332  0.988167  0.393486  0.697487    NaN
333  0.018883  0.250007  0.293452    NaN

[332 rows x 4 columns]

In [87]:
newdf.head(3)

          B         C         E      0
0  0.536579  0.792987  0.355710  654.0
2  0.023143  0.917779  0.646234    NaN
3  0.689296  0.218977  0.662938    NaN

In [90]:
newdf.reset_index(drop=True,inplace=True)

In [91]:
newdf.head(3)

          B         C         E      0
0  0.536579  0.792987  0.355710  654.0
1  0.023143  0.917779  0.646234    NaN
2  0.689296  0.218977  0.662938    NaN

In [92]:
newdf['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
327    False
328    False
329    False
330    False
331    False
Name: B, Length: 332, dtype: bool

In [94]:
newdf['B']=None

In [95]:
newdf['B'].isnull()

0      True
1      True
2      True
3      True
4      True
       ...
327    True
328    True
329    True
330    True
331    True
Name: B, Length: 332, dtype: bool

In [ ]:
df.pd.dataFrame({"